print("Задание 5. Наибольшая сумма цифр")
# Что нужно сделать
# Пользователь вводит N чисел. Среди натуральных чисел,
# которые он указал, найдите наибольшее по сумме цифр.
# Выведите на экран это число и сумму его цифр.

numbers = int(input("Enter a number of digits: "))
maxNumber = 0
summ = 0

for line in range(numbers):
    num = int(input("Enter a number: "))


print(maxNumber)
print(summ)


